In [148]:
import pandas as pd
import numpy as np

In [149]:
data = np.random.randn(4,3)

In [150]:
data

array([[ 0.18681479,  0.13800219, -0.72996152],
       [-0.93440974, -0.01734441, -1.25497088],
       [-0.61310291,  0.00514284,  1.13228164],
       [ 0.93077708, -0.15731264,  1.28804777]])

In [151]:
dataFrame = pd.DataFrame(data)

In [152]:
type(dataFrame[0])

pandas.core.series.Series

In [153]:
dataFrame

          0         1         2
0  0.186815  0.138002 -0.729962
1 -0.934410 -0.017344 -1.254971
2 -0.613103  0.005143  1.132282
3  0.930777 -0.157313  1.288048

In [154]:
yeniDataFrame = pd.DataFrame(data, index=["Oguz","Zeynep","Atlas","Mehmet"],columns = ["Maas","Yas","Calisma Saati"])

In [155]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Oguz    0.186815  0.138002      -0.729962
Zeynep -0.934410 -0.017344      -1.254971
Atlas  -0.613103  0.005143       1.132282
Mehmet  0.930777 -0.157313       1.288048

In [156]:
yeniDataFrame["Yas"]

Oguz      0.138002
Zeynep   -0.017344
Atlas     0.005143
Mehmet   -0.157313
Name: Yas, dtype: float64

In [157]:
yeniDataFrame["Calisma Saati"]

Oguz     -0.729962
Zeynep   -1.254971
Atlas     1.132282
Mehmet    1.288048
Name: Calisma Saati, dtype: float64

In [158]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Oguz    0.186815  0.138002
Zeynep -0.934410 -0.017344
Atlas  -0.613103  0.005143
Mehmet  0.930777 -0.157313

In [159]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Oguz    0.186815  0.138002      -0.729962
Zeynep -0.934410 -0.017344      -1.254971
Atlas  -0.613103  0.005143       1.132282
Mehmet  0.930777 -0.157313       1.288048

In [160]:
yeniDataFrame.loc["Oguz"]

Maas             0.186815
Yas              0.138002
Calisma Saati   -0.729962
Name: Oguz, dtype: float64

In [161]:
yeniDataFrame.loc["Zeynep"]

Maas            -0.934410
Yas             -0.017344
Calisma Saati   -1.254971
Name: Zeynep, dtype: float64

In [162]:
yeniDataFrame.iloc[1]

Maas            -0.934410
Yas             -0.017344
Calisma Saati   -1.254971
Name: Zeynep, dtype: float64

In [163]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Oguz    0.186815  0.138002      -0.729962
Zeynep -0.934410 -0.017344      -1.254971
Atlas  -0.613103  0.005143       1.132282
Mehmet  0.930777 -0.157313       1.288048

In [164]:
yeniDataFrame["Maas"]

Oguz      0.186815
Zeynep   -0.934410
Atlas    -0.613103
Mehmet    0.930777
Name: Maas, dtype: float64

In [165]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [166]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Oguz    0.186815  0.138002      -0.729962        0.276004
Zeynep -0.934410 -0.017344      -1.254971       -0.034689
Atlas  -0.613103  0.005143       1.132282        0.010286
Mehmet  0.930777 -0.157313       1.288048       -0.314625

In [167]:
yeniDataFrame.drop("Emeklilik Yasi", axis=1)

            Maas       Yas  Calisma Saati
Oguz    0.186815  0.138002      -0.729962
Zeynep -0.934410 -0.017344      -1.254971
Atlas  -0.613103  0.005143       1.132282
Mehmet  0.930777 -0.157313       1.288048

In [168]:
yeniDataFrame.drop("Mehmet",axis=0)

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Oguz    0.186815  0.138002      -0.729962        0.276004
Zeynep -0.934410 -0.017344      -1.254971       -0.034689
Atlas  -0.613103  0.005143       1.132282        0.010286

In [169]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Oguz    0.186815  0.138002      -0.729962        0.276004
Zeynep -0.934410 -0.017344      -1.254971       -0.034689
Atlas  -0.613103  0.005143       1.132282        0.010286
Mehmet  0.930777 -0.157313       1.288048       -0.314625

In [170]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1,inplace=True)

In [171]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Oguz    0.186815  0.138002      -0.729962
Zeynep -0.934410 -0.017344      -1.254971
Atlas  -0.613103  0.005143       1.132282
Mehmet  0.930777 -0.157313       1.288048

In [172]:
yeniDataFrame.loc["Oguz"]["Yas"]

0.13800218635049968

In [173]:
yeniDataFrame.loc["Atlas","Yas"]

0.005142835464605491

In [174]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Oguz    0.186815  0.138002      -0.729962
Zeynep -0.934410 -0.017344      -1.254971
Atlas  -0.613103  0.005143       1.132282
Mehmet  0.930777 -0.157313       1.288048

In [175]:
booleanFrame = yeniDataFrame < 0

In [176]:
booleanFrame

         Maas    Yas  Calisma Saati
Oguz    False  False           True
Zeynep   True   True           True
Atlas    True  False          False
Mehmet  False   True          False

In [177]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Oguz    0.186815  0.138002      -0.729962
Zeynep -0.934410 -0.017344      -1.254971
Atlas  -0.613103  0.005143       1.132282
Mehmet  0.930777 -0.157313       1.288048

In [178]:
yeniDataFrame[booleanFrame]

            Maas       Yas  Calisma Saati
Oguz         NaN       NaN      -0.729962
Zeynep -0.934410 -0.017344      -1.254971
Atlas  -0.613103       NaN            NaN
Mehmet       NaN -0.157313            NaN

In [179]:
yeniDataFrame[yeniDataFrame < 0]

            Maas       Yas  Calisma Saati
Oguz         NaN       NaN      -0.729962
Zeynep -0.934410 -0.017344      -1.254971
Atlas  -0.613103       NaN            NaN
Mehmet       NaN -0.157313            NaN

In [180]:
yeniDataFrame[yeniDataFrame["Yas"] > 0]

           Maas       Yas  Calisma Saati
Oguz   0.186815  0.138002      -0.729962
Atlas -0.613103  0.005143       1.132282

In [181]:
yeniDataFrame[yeniDataFrame["Calisma Saati"] > 0]

            Maas       Yas  Calisma Saati
Atlas  -0.613103  0.005143       1.132282
Mehmet  0.930777 -0.157313       1.288048

In [182]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Oguz    0.186815  0.138002      -0.729962
Zeynep -0.934410 -0.017344      -1.254971
Atlas  -0.613103  0.005143       1.132282
Mehmet  0.930777 -0.157313       1.288048

In [183]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0    Oguz  0.186815  0.138002      -0.729962
1  Zeynep -0.934410 -0.017344      -1.254971
2   Atlas -0.613103  0.005143       1.132282
3  Mehmet  0.930777 -0.157313       1.288048

In [184]:
yeniIndeksListesi = ["Ogu","Zey","Atl","Meh"]

In [185]:
yeniDataFrame["Yeni Indeks"] = yeniIndeksListesi

In [186]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Oguz    0.186815  0.138002      -0.729962         Ogu
Zeynep -0.934410 -0.017344      -1.254971         Zey
Atlas  -0.613103  0.005143       1.132282         Atl
Mehmet  0.930777 -0.157313       1.288048         Meh

In [187]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ogu          0.186815  0.138002      -0.729962
Zey         -0.934410 -0.017344      -1.254971
Atl         -0.613103  0.005143       1.132282
Meh          0.930777 -0.157313       1.288048

In [188]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Oguz    0.186815  0.138002      -0.729962         Ogu
Zeynep -0.934410 -0.017344      -1.254971         Zey
Atlas  -0.613103  0.005143       1.132282         Atl
Mehmet  0.930777 -0.157313       1.288048         Meh

In [189]:
yeniDataFrame.set_index("Yeni Indeks",inplace=True)

In [190]:
yeniDataFrame

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ogu          0.186815  0.138002      -0.729962
Zey         -0.934410 -0.017344      -1.254971
Atl         -0.613103  0.005143       1.132282
Meh          0.930777 -0.157313       1.288048

In [193]:
yeniDataFrame.loc["Ogu"]

Maas             0.186815
Yas              0.138002
Calisma Saati   -0.729962
Name: Ogu, dtype: float64

In [194]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [198]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [208]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [209]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [210]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [216]:
type(birlesmisIndeks)

pandas.core.indexes.multi.MultiIndex

In [224]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [225]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [226]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [227]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndeks,columns=["Yas","Meslek"])

In [228]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [229]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [231]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [232]:
cizgiFilmDataFrame.index.names = ["Film Ad", "sim"]

In [233]:
cizgiFilmDataFrame

                   Yas Meslek
Film Ad   sim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F